<!DOCTYPE html>
<html lang="pt">
<head>
    <title>FichaGithub_PWA_2024</title>
</head>
<body>
<h1>FichaGithub_PWA_2024</h1>
<p>
<ol>
    <li>O que s&atilde;o opera&ccedil;&otilde;es de <b>&ldquo;Commit&rdquo;</b>, <b>&ldquo;Push&rdquo;</b> e <b>&ldquo;Pop&rdquo;</b>
        efetuadas num reposit&oacute;rio?
        <p>
            A opera&ccedil;&atilde;o de commit permite guardar um conjunto local de altera&ccedil;&otilde;es ao c&oacute;digo
            enquanto que a opera&ccedil;&atilde;o de push submete ou envia os commits locais para um reposit&oacute;rio
            centralizado. A opera&ccedil;&atilde;o de pop est&aacute; relacionada com a stash que &eacute; um lugar
            tempor&aacute;rio para guardar altera&ccedil;&otilde;es que ainda n&atilde;o foram guardadas com o commit,
            permitindo alterar entre branches sem transpor essas altera&ccedil;&otilde;es entre branches.
        </p>
    </li>
    <li>Quais s&atilde;o as vantagens de usar <i>Branchs</i> num <u>reposit&oacute;rio git</u>?
        <p>
            Utilizar branches permite que diversos engenheiros contribuam em simult&acirc;neo para o mesmo c&oacute;digo,
            existindo no final um merge de todas as altera&ccedil;&otilde;es num branch final. Por outro lado, diversas
            t&eacute;cnicas
            de organiza&ccedil;&atilde;o da evolu&ccedil;&atilde;o do c&oacute;digo, utilizam branches para representar
            uma
            nova Sprint, ou uma nova funcionalidade, ou at&eacute; um bug-fix em produ&ccedil;&atilde;o.
        </p>
    </li>
    <li>Nos Merges de conte&uacute;dos resultantes de um <b>&ldquo;Pop&rdquo;</b> podem resultar em conflitos. Em que
        consistem
        e como podem ser resolvidos esses conflitos?
        <p>
            Os conflitos de merge resultam quando existem m&uacute;ltiplas altera&ccedil;&otilde;es &agrave; mesma linha
            de um ficheiro. O git apenas consegue resolver automaticamente conflitos em linhas distintas. Para resolver
            os conflitos existem duas op&ccedil;&otilde;es, ou escolher uma das altera&ccedil;&otilde;es como a final ou
            manualmente unir as altera&ccedil;&otilde;es para produzir um ficheiro final que contenha todas as altera&ccedil;&otilde;es.
        </p>
    </li>
    <li><b>&ldquo;Clone&rdquo;</b> e <b>&ldquo;Fork&rdquo;</b> s&atilde;o formas diferentes de replicar um reposit&oacute;rio
        Git.
        Quais as diferen&ccedil;as entre eles?
        <p>
            Tanto Clone como Fork permitem replicar um reposit&oacute;rio no entanto com algumas diferen&ccedil;as. Por
            um lado, o Clone, apenas ir&aacute; replicar o reposit&oacute;rio central como Github ou Gitlab para o
            computador onde se executa clone, mantendo o remote original, permitindo colaborar e submeter altera&ccedil;&otilde;es
            para esse reposit&oacute;rio central, assumindo que o utilizador tem permiss&otilde;es. Por outro lado, o
            Fork replica o reposit&oacute;rio central de uma conta para outra conta, permitindo assim que utilizadores
            sem permiss&otilde;es possam fazer altera&ccedil;&otilde;es &quot;locais&quot; e podendo atrav&eacute;s de
            PR submeter essas altera&ccedil;&otilde;es para o reposit&oacute;rio original.
        </p>
    </li>
</ol>
</p>
</body>
</html>